# Ввести значення(рік), вивести повідомлення `It's a leap year!` якщо рік
# високосний і `This is not a leap year!` якщо ні.
import datetime
import math

y = int(input("Enter a year: "))
d = datetime.datetime(y, 12, 31)
if int(d.strftime("%j")) == 366:
    print("It's a leap year!")
else:
    print("This is not a leap year!")

# Ввести три значення (рік, місяць, день) у відповідні змінні. Визначити
# чи введені дані відповідають коректному запису дати.
y = int(input("Enter a year: "))
m = int(input("Enter a month: "))
d = int(input("Enter a day: "))
x = datetime.datetime.now()
if int(x.strftime("%Y")) == y and int(x.strftime("%m")) == m and int(x.strftime("%d")) == d:
    print("It's a correct date!")
else:
    print("It's not a correct date!!")

# Для довільних дійсних чисел `a`, `b`, і `c` визначити, чи має рівняння
# `ax2+bx+c=0` хоча б один дійсний корінь і якщо так, то видрукувати
# його.


# Задано три довільних числа. Визначити, чи можна побудувати
# трикутник з такими довжинами сторін; Якщо так, то видрукувати його
# периметр та площу.
a = int(input("Введіть сторону трикутника a: "))
b = int(input("Введіть сторону трикутника b: "))
c = int(input("Введіть сторону трикутника c: "))
l = [a, b, c]
l.sort()
if l[2] < l[0] + l[1]:
    p = a + b + c
    s = math.sqrt(p/2*(p/2-a)*(p/2-b)*(p/2-c))
    print(f"Периметр трикутника = {p}, площа трикутника = {s}")
else:
    print("Неможливо побудувати трикутник")

# Нехай `k`- ціле від `1` до `365`. Присвоїти цілій змінній n значення
# (понеділок, вівторок, …, суботу чи неділю) залежно від того , на який
# день тижня припадає `k`-й день не високосного року, в якому 1 січня -
# понеділок.
k = int(input("Введіть число від 1 до 365: "))
week = ["Понеділок", "Вівторок", "Середа", "Четвер", "П'ятниця", "Субота", "Неділя"]
i = 0
while i < k:
    for n in week:
        i += 1
print(f"{k} день не високосного року це {n}")
