#  Користувач робить внесок в розмірі n гривень строком на years років під 10% річних (щороку розмір його внеску збільшується на 10%.
#  Ці гроші додаються до суми вкладу, і на них в наступному році теж будуть відсотки).
#  Написати функцію bank, яка приймає аргументи n і years, і повертає суму, яка буде на рахунку користувача.

def bank(n, years):
    for i in range(years):
        n = n + (n * 0.1)
        print(f"На кінець {i+1} року, сумма складатиме: {n}")
    return n

n = int(input("Введіть бажану сумму депозиту: "))
y = int(input("Введіть срок депозиту: "))
print(f"\nСумма на кінець сроку становитиме: {bank(n, y)}")


